Revit 2027 API
PipeFittingAndAccessoryData.SystemClassification Property
 The system classification of the pipe fitting or pipe accessory.
Namespace: Autodesk.Revit.DB.Plumbing
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public MEPSystemClassification SystemClassification { get; }
Public ReadOnly Property SystemClassification As MEPSystemClassification
	Get
public:
property MEPSystemClassification SystemClassification {
	MEPSystemClassification get ();
}
member SystemClassification : MEPSystemClassification with get
Property Value
MEPSystemClassification
See Also
Reference
PipeFittingAndAccessoryData Class
Autodesk.Revit.DB.Plumbing Namespace